In [2]:
import sqlite3

In [10]:
con = sqlite3.connect('teste.db')
cur = con.cursor()

In [11]:
cur.execute('''
            CREATE TABLE IF NOT EXISTS categorias (
                id INTEGER PRIMARY KEY,
                nome TEXT NOT NULL)
            ''')

In [12]:
cur.execute('''PRAGMA table_info(categorias)''')
estrutura = cur.fetchall()
for coluna in estrutura:
    print(coluna)

(0, 'id', 'INTEGER', 0, None, 1)
(1, 'nome', 'TEXT', 1, None, 0)

In [15]:
cur.execute('''select name from sqlite_master where type = 'table' ''')
for table in cur.fetchall():
    print(table [0])

In [13]:
cur.execute('''ALTER TABLE categorias ADD COLUMN ativo BOOLEAN DEFAULT 1''')

In [14]:
cur.execute('''DROP TABLE categorias''')

In [1]:
import pandas as pd

In [3]:
dados = {
    'nome':['João', 'Maria', 'Pedro','José'],
    'idade':[28, 34, 29, 40],
    'cidade':['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Curitiba'],
    'Salário':[3500.00, 4200.50, 3100.75, 5000.00]
}
df = pd.DataFrame(dados)
print(df)

    nome  idade          cidade  Salário
0   João     28       São Paulo  3500.00
1  Maria     34  Rio de Janeiro  4200.50
2  Pedro     29  Belo Horizonte  3100.75
3   José     40        Curitiba  5000.00

In [4]:
con = sqlite3.connect('teste.db')
cur = con.cursor()

In [21]:
cur.execute('''
            CREATE TABLE IF NOT EXISTS pessoas (
                id INTEGER PRIMARY KEY AUTOINCREMENT,
                nome TEXT NOT NULL,
                idade INTEGER NOT NULL,
                cidade TEXT NOT NULL,
                salário REAL NOT NULL)
            ''')

In [22]:
cur.execute('''
INSERT INTO pessoas (nome, idade, cidade, salário) VALUES 
            ('Antônio', '25', 'Caldas Novas','2000'),
            ('Ana', 30, 'Salvador', 3800),
            ('Paula', 30, 'Rio de Janeiro', 3900)
             ''')

In [24]:
con.commit()

In [32]:
cur.execute('''
SELECT * FROM pessoas where salário >= 3500 ORDER BY salário DESC
            ''')
resultado = cur.fetchall()
for linha in resultado:
    print(linha)

(3, 'Paula', 30, 'Rio de Janeiro', 3900.0)
(6, 'Paula', 30, 'Rio de Janeiro', 3900.0)
(5, 'Ana', 30, 'Salvador', 3800.0)

In [31]:
cur.execute(''' delete from pessoas where id = 2 ''')
con.commit()

In [35]:
print(df)

    nome  idade          cidade  Salário
0   João     28       São Paulo  3500.00
1  Maria     34  Rio de Janeiro  4200.50
2  Pedro     29  Belo Horizonte  3100.75
3   José     40        Curitiba  5000.00